<?php
/*
Template Name: about
Template Post Type: post, page, product
*/
?>

<?php get_header(); ?>


<div class="container popular">
    <div class="row">
        <div class="col-lg-6 col-12 offset-lg-3 offset-0">
            <h2 class="page-title text-center"><?php the_title() ?></h2>
            <p class="after-title">Мы пишем только вместе и только под
                одним псевдонимом - Марина Эльденберт.</p>
        </div>
    </div>
    <div class="row">
        <div class="col-lg-6 col-12">
            <div class="about-image">
                <img src="" alt="">
                <p class="about-image__text"></p>
            </div>
        </div>
        <div class="col-lg-6 col-12">
            <div class="about-image">
                <img src="" alt="">
                <p class="about-image__text"></p>
            </div>
        </div>
    </div>
    <div class="row">
        <div class="col-lg-4 offset-lg-4 col-12-offset-0">
            <p class="about-image-after">За эти шесть лет мы прошли
                действительно огромный путь.</p>
        </div>
    </div>
    <div class="row">
        <div class="col-lg-5 offset-lg-1 col-12 offset-0">
            <p class="about-content">Написать <strong>26 романов</strong>
                ( + 2 в процессе написания)</p>
            <p>Опубликовать более 15 книг в крупнейших издательствах России (Альфа-книга, Clever, АСТ, ЭКСМО, Рипол)</p>
            <p>Стать победительницей конкурса «Руны любви. Весна-лето 2016» издательства АСТ («Заклятые супруги. Золотая мгла», июнь 2016 г.)</p>
        </div>
        <div class="col-lg-5 col-12">
            <p>Написать книгу, взорвавшую Инстаграм («Бабочка», издательство Clever, 2019 год)
            </p>
            <p>Номинироваться на премию «Лучшая книга года» в жанре «Русское фэнтези» («Бабочка», издательство Clever, 2019 г.)</p>
            <p>Стать рекордсменом сайта Литнет по количеству проданных за сутки книг («Поющая для дракона. Между двух огней», август 2017 г)</p>
        </div>
    </div>
</div>
</div>
</div>
<div class="about-bg bg-light">
    <div class="container">
        <div class="row">
            <div class="col-lg-10 offset-lg-1 col-12 offset-0">
                <div class="about-card">
                    <div class="about-card-body">
                        <p class="about-card-body__text">
                            Нас называют: самыми скандальными авторами рунета, королевами ромфанта, авторами самых неоднозначных историй.

                            Читатели ценят наши книги за остроту эмоций и чувственность, неожиданные сюжетные повороты, а также волшебные и красивые миры. Писательство для
                            нас – не только профессия!
                            Мы кайфуем от того, что мы делаем.
                            Все наши книги написаны на диком кураже и вдохновении.

                            В каждую историю мы вкладываем частичку нашей души и сердца. Так же, как в этот сайт:

                            Здесь пространство, созданное нами только для вас
                            Здесь на все комментарии мы отвечаем лично
                            Здесь мы делимся своим опытом

                            Если вы влюблены в наших героев и истории так же, как в них влюблены мы, или еще только хотите с ними познакомиться...

                            Если вы хотите узнать нашу историю успеха...

                            Если вы готовы выигрывать книги с автографами, сувениры и абонементы на бесплатное чтение наших книг, первыми узнавать чуть больше, чем остальные (в закрытом разделе VIP-клуб), и с головой погружаться в фантастические чувственные миры…


                            Добро пожаловать!

                        </p>
                        <p class="about-wishes">
                            С любовью,
                            Ваши Марина и Ксения
                            <span class="about-wishes__pen">
                                <img src="" alt="">
                            </span>
                        </p>
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>


<?php get_footer(); ?>
