<?php
/*
Template Name: return
Template Post Type: post, page, product
*/
?>

<?php get_header(); ?>

<div class="container pb-5">
    <div class="row">
        <div class="col-12">
            <h2 class="page-title">Политика возврата денежных средств</h2>
            <p>До совершения покупки каждый читатель имеет право ознакомиться с информацией о книге и принять взвешенное
                решение о целесообразности покупки. </p>
            <p>Отмена покупки и возврат денежных средств</p>
            <ul>
                <li>Если вы передумаете относительно покупки, сделанной на сайте <a href="https://marina-eldenbert.ru/">marina-eldenbert.ru</a>,
                    можно запросить ее
                    отмену или возврат денежных средств в течение 14 дней с даты совершения оплаты, при условии, что вы
                    не начали онлайн чтение купленной книги или не скачали ее.
                </li>
                <li>Нельзя отказаться от приобретенной цифровой книги, которая уже загружена или вы читаете ее онлайн,
                    если только не выявлены технические недостатки файла книги, не позволяющие читать её.
                </li>
            </ul>
            <p>Условия возврата:</p>
            <ul>
                <li>Для возврата средств нужно направить запрос на адрес электронной почты <a
                            href="mailto:help@marina-eldenbert.ru">help@marina-eldenbert.ru</a> с описанием причины
                    возврата, реквизитами для его получения.
                </li>
                <li>Возврат производится в течение нескольких дней с момента одобрения возврата сотрудником поддержки.
                    Иногда на это требуется больше времени, но не более 10 рабочих дней.
                </li>
            </ul>
            <p>Способы возврата:</p>
            <p>Возврат средств производится тем же способом каким средства были переведены в <a href="https://marina-eldenbert.ru/">marina-eldenbert.ru</a>.</p>
            <p>Не является публичной офертой.</p>
            <p>Условия возврата могут быть изменены в одностороннем порядке.</p>
        </div>
    </div>
</div>

<?php get_footer(); ?>
